# Parameter Type Id Rebar Crank Length Multiplier Property

Source: https://www.revitapidocs.com/2026/1fb3e667-a5b9-b934-8ab4-e694ae18dcea.htm

---

| Parameter Type Id Rebar Crank Length Multiplier Property |
| --- |

"Length Multiplier"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankLengthMultiplier { get; }
```

```
Public Shared ReadOnly Property RebarCrankLengthMultiplier As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankLengthMultiplier {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankLengthMultiplier : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace